#include "Delay.h"

u8  fac_us = 0;				//== us延时系数
u16 fac_ms = 0;				//== ms延时系数

/*************************************************************************************************/
/* 功能：滴答定时器初始化          																															 */
/* 输入：系统时钟，单位：MHz                                                										 */
/* 输出：无                                                                                      */
/* 描述：SYSTICK配置                                                                             */
/*************************************************************************************************/
void SysTick_Init(u8 SYSCLK)
{ 
    SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK_Div8);  //== SYSTICK时钟源配置
    fac_us = SYSCLK / 8; 																	 //== us系数
    fac_ms = (u16)fac_us*1000;  													 //== ms系数
}

/*************************************************************************************************/
/* 功能：SYSTICK延时（硬件延时）          																											 */
/* 输入：us倍乘数                                                										             */
/* 输出：无                                                                                      */
/* 描述：微秒延时                                                                                */
/*************************************************************************************************/
void delay_us(u32 nus)
{
    u32 temp;
    SysTick->LOAD = nus*fac_us;
    SysTick->VAL = 0;
    SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;
    do{
      temp = SysTick->CTRL;
    }while((temp&0x01)&&(!(temp&(1<<16))));
    SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;
    SysTick->VAL = 0;
}

/*************************************************************************************************/
/* 功能：SYSTICK延时（硬件延时）          																											 */
/* 输入：ms倍乘数                                                										             */
/* 输出：无                                                                                      */
/* 描述：毫秒延时                                                                                */
/*************************************************************************************************/
void delay_ms(u32 nms)
{
    u32 temp;
    SysTick->LOAD = nms*fac_ms;
    SysTick->VAL = 0;
    SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;
    do{
      temp = SysTick->CTRL;
    }while((temp&0x01)&&(!(temp&(1<<16))));
    SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;
    SysTick->VAL = 0;
}

/*************************************************************************************************/
/* 功能：软件延时                          																											 */
/* 输入：ms倍乘数                                                										             */
/* 输出：无                                                                                      */
/* 描述：毫秒延时                                                                                */
/*************************************************************************************************/
void delayms(uint16_t ms)
{
    while(ms--)		for(uint16_t i=0;i<10286;i++);
}
